Revit 2026 API

# WallSketchId Property

---

Returns id of the profile sketch, or invalidElementId if sketch does not exist.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId SketchId { get; }
```
```vb
Public ReadOnly Property SketchId As ElementId
	Get
```
```cpp
public:
property ElementId^ SketchId {
	ElementId^ get ();
}
```
```fsharp
member SketchId : ElementId with get
```

#### Property Value

ElementId

To create profile Sketch for the Wall, call CreateProfileSketch.

#### Reference

Wall Class

Autodesk.Revit.DB Namespace